СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ИндивидуальныеПланыЛиквидацииЗадолженностей/ИндивидуальныеПланыЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныеПланыЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявленияНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявленияНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>DocumentRef.ЗаявленияНаПродлениеСроковЛиквидацииЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ИндивидуальныеПланыЛиквидацииЗадолженностей/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявленияНаПродлениеСроковЛиквидацииЗадолженности") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
		Причина = ДанныеЗаполнения.Ссылка;
		Студент = ДанныеЗаполнения.Студент;
		ФормаКонтроля = ДанныеЗаполнения.ФормыКонтроля;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
